import React from "react";
import { CommunityForm } from "../components/CommunityForm";
import { CommunityContainer, CommunityContent, CommunityTitle, List, ListLink, Views, Writer } from "../css/Community";

export const Post = () => {
  return (
    <CommunityContainer>
      <CommunityTitle>{`글제목 `}</CommunityTitle>
      <Writer>작성자 / 날짜</Writer>
      <Views>조회수 : 231</Views>
      <List>
        <ListLink to="/community">목록</ListLink>
      </List>
      <CommunityContent>
        안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은
        찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요.
        계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을
        잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요...
        술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이
        없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서
        주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가
        일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가
        핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요..
        안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은
        찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요.
        계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을
        잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요...
        술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이
        없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서
        주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가
        일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가
        핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요..
        안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은
        찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요.
        계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을
        잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요...
        술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이
        없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서
        주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가 핸드폰을 잃어버렸습니다.. 하루가
        일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요.. 안녕하세요... 술처먹고 자전거 타다가
        핸드폰을 잃어버렸습니다.. 하루가 일주일 같네요. 계속 꺼져있어서 주운 사람은 찾아줄 생각이 없나봐요..
      </CommunityContent>
    </CommunityContainer>
  );
};
